fun main(args: Array<String>)
{
    //Task_1____________________________________________________________________

    val age1: Int = 42; //Объявление константы age типа . . . , присваивание ей типа Int + значения
    val age2: Int = 21; //Абсолютно такое же действие только с этой константой


    //Task_2____________________________________________________________________

    val avg1: Double = (age1.toDouble() + age2.toDouble())/2;//Объявление константы ... типа ...Присваивание ей значения через нахождения среднего арифметического age1 и age2

    println(avg1)
    //Task_3____________________________________________________________________


    //Task_4____________________________________________________________________
    //Создание двух констант типа ... значения их имя и фамилия
    val firstName: String = "Лилия ";
    val lastName: String = "Беликова";

    //Task_5____________________________________________________________________

    val fullName: String = firstName + lastName;//Объявление константы типа ... значение ее сложение двух прошлых строковых констант


    //Task_6____________________________________________________________________

    val myDetails = "Здравствуй, меня зовут $fullName";//созданная строковая константа ..., которая использует константу ..., с помощью шаблонных строк создает представляющую строку(надпись)
    println(myDetails);//Вывод на консоль для проверки

    //Task_7____________________________________________________________________

    val triple :Triple <Int, Int, Int> = Triple (5, 15, 2020);
    
    //Task_8____________________________________________________________________

    val month = triple.second;
    val day = triple.first;
    val year = triple.third;
    //Task_9____________________________________________________________________

    println("Месяц: $month Год: $year");

    //Task_10____________________________________________________________________

    var (second, third) = triple;
    second = 9;
    third = 2023;

    val pair: Pair <Int, Int> = Pair (second,third);

    println("Измененный месяц: $second Измененный год: $third");
}